-- 初始化变量
teshubaofa = false

-- 特定目标列表
local specificTargets = {
    
"大领主的训练假人",
    "新兵的训练假人",
    "精兵的的训练假人",
    "黑锋骑士的训练假人",
    "学徒的训练假人",
    "专家的训练假人",
    "英雄训练假人",
"大师的训练假人",
"纳多克斯长老",
"塔达拉姆王子",
"埃曼尼塔",
"耶戈达·觅影者",
"传令官沃拉兹",
"看门者克里克希尔",
"哈多诺克斯",
"阿努巴拉克",
"托尔戈",
"召唤者诺沃斯",
"暴龙之王爵德",
"先知萨隆亚",
"斯拉德兰",
"达克莱巨像",
"莫拉比",
"凶残的伊克",
"迦尔达拉",
"比亚格里将军",
"沃尔坎",
"艾欧纳尔",
"洛肯",
"克莱斯塔卢斯",
"悲伤圣女",
"塑铁者斯约尼尔",
"肉钩",
"塑血者沙尔拉姆",
"时光领主埃博克",
"玛尔加尼斯",
"永恒腐蚀者",
"指挥官库鲁尔格",
"大魔导师泰蕾丝塔",
"阿诺玛鲁斯",
"塑树者奥莫洛克",
"克莉斯塔萨",
"审讯者达库斯",
"瓦尔洛斯·云击",
"法师领主伊洛姆",
"魔网守护者埃雷苟斯",
"埃雷克姆",
"湮灭者祖拉玛特",
"谢沃兹",
"艾库隆",
"摩拉格",
"拉文索尔",
"塞安妮苟萨",
"凯尔塞斯王子",
"控制者达尔隆",
"建筑师斯卡瓦尔德",
"劫掠者因格瓦尔",
"席瓦拉·索格蕾",
"戈托克·苍蹄",
"残忍的斯卡迪",
"伊米隆国王",
"纯洁者耶德瑞克",
"银色神官帕尔崔丝",
"黑骑士",
"布隆亚姆",
"噬魂者",
"熔炉之主加弗斯特",
"科瑞克",
"伊克",
"天灾领主泰兰努斯",
"法瑞克",
"马维恩",
"阿努布雷坎",
"黑女巫法琳娜",
"迈克斯纳",
"药剂师诺斯",
"肮脏的希尔盖",
"洛欧塞布",
"教官拉苏维奥斯",
"收割者戈提克",
"帕奇维克",
"格罗布鲁斯",
"格拉斯",
"塔迪乌斯",
"萨菲隆",
"克尔苏加德",
"大领主莫格莱尼",
"库尔塔兹领主",
"瑟里耶克爵士",
"女公爵布劳缪克丝",
"玛里苟斯",
"萨塔里奥",
    "掌炉者伊格尼斯",
    "锋鳞",
    "XT-002拆解者",
    "拆解者之心",
    "科隆加恩",
    "左臂",
    "右臂",
    "断钢者",
    "符文大师莫尔基姆",
    "唤雷者布隆迪尔",
    "观察者奥尔加隆",
    "欧尔莉亚",
    "霍迪尔",
    "托里姆",
    "芙蕾亚",
    "爆炸鞭笞者",
    "风暴鞭笞者",
    "迅疾鞭笞者",
    "古代水之精魄",
    "VX-001",
    "巨兽二型",
    "空中指挥单位",
"维扎克斯将军",
"萨隆邪铁畸体",
"尤格-萨隆",
"不朽的守护者",
"尤格-萨隆的卫士",
"重压触须",









}

-- 检查当前目标是否为特定目标
local function updateteshubaofa()
    local targetName = UnitName("target")
    teshubaofa = false  -- 默认设置为 false
    if targetName then
        for _, name in ipairs(specificTargets) do
            if targetName == name then
                teshubaofa = true  -- 如果目标在列表中，设置为 true
                break
            end
        end
    end

end

-- 创建一个框架用于监听事件
local frame = CreateFrame("Frame")
frame:RegisterEvent("PLAYER_TARGET_CHANGED")  -- 目标变更事件
frame:SetScript("OnEvent", function(self, event, ...)
    if event == "PLAYER_TARGET_CHANGED" then
        updateteshubaofa()  -- 调用函数更新 teshubaofa
    end
end)
